package com.teamtriad.forpets.model.tmp

data class Volunteer(
    val name: String,
    val shortenedLocationFrom: String,
    val shortenedLocationTo: String,
    val date: String,
    val detailFrom: String,
    val detailTo: String,
    val message: String,
)

object Volunteers {
    fun loadList(): List<Volunteer> {
        return listOf(
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "김새싹",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ), Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            ),
            Volunteer(
                "홍길동",
                "서울특별시",
                "부산광역시",
                "24-01-10 ~ 24-01-13",
                "서울특별시 강서구, 양천구",
                "부산광역시 수정구, 해운대구",
                "10일에서 13일 중 11일을 제외한\n모든 날에 가능합니다"
            )
        )
    }
}
